[
  {
    "title": "Accretion Disk",
    "content": "<p>An accretion disk is a massive, rotating structure of gas, plasma, dust, or other material that forms around a central object under the influence of gravity. These disks occur in various astrophysical systems, such as around young stars (protoplanetary disks), white dwarfs in binary systems, neutron stars, and black holes. As matter spirals inward, it heats up due to friction and viscous dissipation, radiating energy in the form of electromagnetic radiation. The process allows the central object to gain mass over time while conserving angular momentum in the system.</p><p>The physics of accretion disks varies depending on the mass and nature of the central body. In the case of stellar-mass or supermassive black holes, accretion disks can become extraordinarily luminous, especially in the X-ray portion of the spectrum. Near the event horizon of a black hole, relativistic effects become significant. The infalling material reaches extreme temperatures—millions of Kelvin—producing high-energy emissions. These emissions are often used to infer the presence of black holes, which themselves emit no light.</p><p>According to NASA, accretion is the primary method by which black holes grow, particularly during the early formation of galaxies. Matter from the surroundings, such as interstellar gas or disrupted stars, feeds the black hole through this disk. The disk’s radiation pressure and magnetic fields may also lead to the formation of relativistic jets, which shoot perpendicular to the disk and extend far beyond the host galaxy. These jets play a critical role in regulating galaxy formation and can influence intergalactic environments.</p><p>One of the fundamental challenges in accretion disk theory is explaining how angular momentum is transferred outward to allow matter to move inward. The magnetorotational instability (MRI), discussed extensively in astrophysical research, provides a compelling mechanism. It proposes that even a weak magnetic field in a differentially rotating disk can give rise to turbulence, which acts like an effective viscosity. This turbulence enhances the transport of angular momentum and enables sustained accretion.</p><p>Modern simulations and theoretical frameworks now include general relativistic magnetohydrodynamics (GRMHD) to more accurately capture the extreme environments near compact objects. Recent models show how black hole spin, magnetic field topology, and disk composition affect accretion rates and jet power. These high-resolution simulations align well with observations from facilities like the Event Horizon Telescope (EHT), which imaged the shadows of black holes in M87 and the Milky Way.</p><p>In less extreme environments, such as around young stars, accretion disks are the sites of planet formation. Observations from ALMA and other observatories have revealed ringed disk structures that suggest early stages of planetary accretion and migration. These systems provide a vital laboratory for understanding how solar systems like our own originate.</p><p>Accretion disks are not static—they evolve over time, influenced by instabilities, magnetic reconnection, radiation pressure, and even external events like tidal disruption of nearby stars. The balance of forces in the disk can lead to variability in luminosity, including outbursts in systems like dwarf novae or X-ray transients. Such variability gives astronomers valuable insight into the dynamics of the accreting material.</p><p>In summary, accretion disks are fundamental to astrophysics, linking the growth of cosmic structures to the extreme physics of gravity, relativity, and magnetohydrodynamics. Whether forming planets or feeding black holes, these swirling disks of matter continue to reveal the underlying processes shaping our universe.</p>",
    "sources": [
      {
        "title": "NASA Science – Black Holes",
        "url": "https://science.nasa.gov/astrophysics/focus-areas/black-holes"
      },
      {
        "title": "MRI and Turbulent Accretion Disks (2011)",
        "url": "https://arxiv.org/pdf/1104.5499"
      },
      {
        "title": "Black Hole Accretion Simulations (2022)",
        "url": "https://arxiv.org/pdf/2201.07262"
      }
    ]
  },
    {
    "title": "Light-Year",
    "content": "<p>A light-year is a unit of distance used in astronomy to express vast stretches between celestial objects. It represents the distance that light travels in a vacuum in one Julian year (365.25 days). Since light moves at approximately 299,792 kilometers per second (or about 186,282 miles per second), one light-year equals roughly 9.4607 trillion kilometers (5.88 trillion miles).</p><p>Despite its name, a light-year measures distance, not time. Astronomers use it because ordinary units like kilometers or miles become impractical at interstellar and intergalactic scales. For example, instead of saying that Proxima Centauri is nearly 40 trillion kilometers away, it's more comprehensible to say it’s 4.24 light-years from Earth.</p><p>Observing distant objects in light-years also means looking back in time. Because light takes time to travel, when we view an object one light-year away, we see it as it was one year ago. This 'lookback time' becomes even more significant with galaxies billions of light-years away — we observe them as they were billions of years in the past.</p><p>The light-year can be compared to other astronomical units. It is equivalent to about 63,240 astronomical units (AU), where one AU is the average distance between Earth and the Sun. A light-year is also roughly equal to 0.3066 parsecs (pc), a unit commonly used by professional astronomers.</p><p>For nearer objects, smaller light-based units are used. For example, light from the Sun takes about 8 minutes and 20 seconds to reach Earth (light-minutes), while signals from the Moon arrive in just over a second (light-seconds).</p><p>Understanding the light-year helps make sense of the immense scale of the universe and allows scientists and the public alike to grasp the staggering distances between stars, galaxies, and other celestial bodies.</p>",
    "sources": [
      {
        "title": "NASA Science – What is a Light-Year?",
        "url": "https://science.nasa.gov/exoplanets/what-is-a-light-year/"
      },
      {
        "title": "NASA Space Place – What Is a Light-Year?",
        "url": "https://spaceplace.nasa.gov/light-year/en/"
      },
      {
        "title": "ESA – Measuring Stellar Distances",
        "url": "https://sci.esa.int/web/education/-/35616-stellar-distances"
      },
      {
        "title": "Swinburne University – Cosmos: Light Year",
        "url": "https://astronomy.swin.edu.au/cosmos/L/Light+Year"
      }
    ]
  },
    {
    "title": "Redshift",
    "content": "<p>In astronomy, redshift refers to the phenomenon where light or other electromagnetic radiation from an object is shifted toward longer (redder) wavelengths. This effect results in a decrease in frequency and energy and occurs in three primary contexts: Doppler redshift, gravitational redshift, and cosmological redshift.</p><p>Doppler redshift happens when a light-emitting object moves away from the observer. Similar to how a siren sounds lower in pitch as it moves away, the light’s wavelength is stretched. Gravitational redshift, predicted by Einstein’s General Theory of Relativity, occurs when light escapes a strong gravitational field and loses energy, resulting in longer wavelengths. Cosmological redshift is due to the expansion of the universe itself: as space expands, it stretches the light traveling through it, increasing the wavelength.</p><p>Redshift is measured using the dimensionless parameter z, calculated as z = (λ_observed − λ_emitted) / λ_emitted. For relatively nearby galaxies, this can be directly related to velocity via v ≈ z × c, where c is the speed of light. In very distant galaxies, redshift indicates how long the light has been traveling and, by extension, how far away the galaxy is.</p><p>Redshift is central to modern cosmology. Edwin Hubble’s discovery in 1929 that more distant galaxies exhibit greater redshifts led to the formulation of Hubble’s Law, which describes the expanding universe. Measuring the redshifts of galaxies and supernovae has also revealed that the universe’s expansion is accelerating, suggesting the presence of dark energy.</p><p>Astronomers detect redshift by comparing the known spectral lines of elements (like hydrogen or calcium) to those observed in light from distant sources. The greater the shift, the farther and older the object is. Today, some galaxies have been observed with redshifts greater than 13, meaning their light has traveled for over 13 billion years, offering a glimpse into the early universe.</p>",
    "sources": [
      {
        "title": "NASA Science – Hubble Cosmological Redshift",
        "url": "https://science.nasa.gov/mission/hubble/science/science-behind-the-discoveries/hubble-cosmological-redshift/"
      },
      {
        "title": "ESA – What is ‘red shift’?",
        "url": "https://www.esa.int/Science_Exploration/Space_Science/What_is_red_shift"
      },
      {
        "title": "University of Iowa Physics – Astronomical Redshift",
        "url": "https://itu.physics.uiowa.edu/labs/advanced/astronomical-redshift"
      },
      {
        "title": "NASA – Pound–Rebka Gravitational Redshift",
        "url": "https://einstein.stanford.edu/content/relativity/q56.html"
      }
    ]
  },
  {
    "title": "Gravity",
    "content": "<p>Gravity is the fundamental force of attraction between all objects that have mass or energy. It governs the motion of planets, the structure of galaxies, and even the flow of time in regions of intense gravity. It acts over infinite distances and cannot be shielded or repelled.</p><p>1. Classical Understanding – Newton's Law<br>Sir Isaac Newton’s law of universal gravitation describes gravity as a force between two masses. The strength of this force is proportional to the product of the masses and inversely proportional to the square of the distance between them: F = G × (m₁ × m₂) / r². This model accurately predicts most orbital motion and physical behavior on Earth and in the solar system.</p><p>2. Modern View – General Relativity<br>Albert Einstein’s general theory of relativity, published in 1915, redefined gravity not as a force, but as the curvature of spacetime caused by mass and energy. Massive objects like stars or black holes bend the space around them, and objects move along these curves. This theory explains phenomena such as gravitational lensing, the orbit of Mercury, and the passage of time near massive bodies.</p><p>3. Everyday Effects<br>Gravity on Earth provides a surface acceleration of about 9.8 meters per second squared (m/s²). It keeps our atmosphere in place, causes tides (through the Moon's gravity), and affects time: atomic clocks tick slightly slower at sea level than on mountaintops due to gravitational time dilation.</p><p>4. Observing Gravity from Space<br>Missions like ESA’s GOCE (Gravity field and steady-state Ocean Circulation Explorer) and NASA's GRACE and GRACE-FO satellites map Earth's gravity with high precision. They reveal changes in water mass, monitor glacial melt, and improve models of sea-level rise and ocean currents.</p><p>5. Advanced Applications<br>Spacecraft use gravitational slingshots to gain speed by flying near planets, saving fuel. Gravity also shapes the evolution of galaxies, regulates star formation, and governs the formation of planetary systems.</p><p>6. Research Frontiers<br>Modern physics seeks to reconcile gravity with quantum mechanics into a theory of quantum gravity. Experiments like those detecting gravitational waves (ripples in spacetime caused by colliding black holes) continue to test general relativity under extreme conditions and expand our understanding of the universe.</p>",
    "sources": [
      {
        "title": "ESA – What is gravity?",
        "url": "https://www.esa.int/Science_Exploration/Space_Science/What_is_gravity"
      },
      {
        "title": "NASA Space Place – What Is Gravity?",
        "url": "https://spaceplace.nasa.gov/what-is-gravity/en/"
      },
      {
        "title": "NASA – How Gravity Warps Light",
        "url": "https://science.nasa.gov/universe/how-gravity-warps-light/"
      },
      {
        "title": "UC Santa Barbara – ESA Satellite Maps Earth’s Gravity",
        "url": "https://legacy.geog.ucsb.edu/esa-satellite-maps-earths-gravity/"
      },
      {
        "title": "NASA Science – Gravity Assist Primer",
        "url": "https://science.nasa.gov/learn/basics-of-space-flight/primer/"
      }
    ]
  },
    {
    "title": "General Relativity",
    "content": "<p>Albert Einstein’s General Theory of Relativity, published in 1915 and finalized in 1916, revolutionized our understanding of gravity. Rather than a force acting at a distance, it describes gravity as the curvature of spacetime caused by mass and energy. Massive objects distort the fabric of spacetime around them, and other objects move along these curved paths.</p><p>In Einstein’s words, space and time are intertwined into a four-dimensional continuum called spacetime. Bending this continuum—much like depressing a trampoline with a heavy ball—causes nearby objects to follow curved trajectories. This geometric view explains phenomena that Newtonian gravity cannot: the precise orbit of Mercury, gravitational lensing of light around stars, and time dilation in gravitational fields.</p><p>The theory is governed by Einstein’s field equations, which relate the distribution of mass-energy (via the stress-energy tensor) to the curvature of spacetime (described by the Einstein tensor and metric tensor). These equations encompass Newton’s law in weak-field limits yet extend to describe extreme scenarios like black holes and expanding universes.</p><p>General relativity has been confirmed through numerous experiments and observations. Key early tests include the bending of starlight during the 1919 solar eclipse—confirming gravitational lensing—and the precise precession of Mercury’s orbit. NASA’s Gravity Probe B mission later verified two subtle effects: geodetic precession and frame-dragging (the “twisting” of spacetime by Earth’s rotation).</p><p>It predicts phenomena such as gravitational redshift—where light loses energy escaping a gravitational field—and gravitational waves, ripples in spacetime from violent cosmic events. The first direct detection of gravitational waves in 2015 (LIGO) further confirmed the theory in the strong-field regime.</p><p>Modern space missions continue to test and utilize general relativity. ESA’s JUICE, LARES, and NASA–ESA LISA missions probe gravitomagnetism, frame-dragging, and spacetime dynamics via precise measuring devices and satellite tracking. They aim to refine existing tests and search for deviations that might point to new physics.</p><p>General relativity remains the cornerstone of modern cosmology and astrophysics. It underpins black hole physics, gravitational lensing, cosmological models, GPS technology, and gravitational-wave astronomy. Efforts persist to reconcile it with quantum mechanics into a unified theory of quantum gravity.</p>",
    "sources": [
      {
        "title": "NASA – Einstein and General Relativity",
        "url": "https://www.nasa.gov/image-article/einstein-general-relativity/"
      },
      {
        "title": "ESA – What is gravity?",
        "url": "https://www.esa.int/Science_Exploration/Space_Science/What_is_gravity"
      },
      {
        "title": "NASA Blueshift – 100 Years of General Relativity",
        "url": "https://asd.gsfc.nasa.gov/blueshift/index.php/2015/11/25/100-years-of-general-relativity/"
      },
      {
        "title": "ESA/Hubble – Gravitational Lensing",
        "url": "https://esahubble.org/wordbank/gravitational-lensing/"
      },
      {
        "title": "Center for Astrophysics – Einstein's Theory of Gravitation",
        "url": "https://pweb.cfa.harvard.edu/research/science-field/einsteins-theory-gravitation"
      }
    ]
  },
    {
    "title": "Speed of Light",
    "content": "<p>The speed of light in a vacuum is a universal constant exactly defined as <strong>299,792,458 m/s</strong> (about 300,000 km/s or 186,000 mi/s). This exact value is fixed because the metre itself is defined by how far light travels in 1/299,792,458 of a second.</p><p>This constant speed—denoted by “c”—is the maximum speed at which information, matter, or energy can travel. It remains the same regardless of the relative motion of the source or observer, a foundational postulate of Einstein’s theory of relativity.</p><p>Light (and all electromagnetic radiation) travels at this constant speed in a vacuum. In materials like air, water, or glass, it moves slower—dependent on the medium’s refractive index. For example, light travels at about two-thirds the vacuum speed in glass.</p><p>The finite speed of light gives rise to time delays over large distances. Sunlight takes about <strong>8 minutes and 20 seconds</strong> to reach Earth, while radio signals to distant spacecraft (like those at Jupiter or Mars) can take minutes or even over an hour to arrive and return.</p><p>Light’s invariant speed underpins the structure of modern physics and cosmology. It implies that no object with mass can reach or exceed c, and it leads to profound effects like time dilation, length contraction, and mass-energy equivalence (E=mc²) under special relativity.</p><p>Accurate measurement of c in vacuum is now a relic: since 1983 the metre is defined by c. Instead, we use precise frequency and wavelength measurements (via lasers and interferometry) to realize the metre standard.</p><p>Astrophysical observations—such as pulsar timing, spacecraft tracking, and laser ranging—depend on c. For example, the delay of light or radio signals gives us distances and tests of gravitational theories. These methods are essential for GPS systems, deep-space navigation, and tests of relativity.</p><p>The constancy of the speed of light is one of the best-tested principles in science. Experiments like Michelson-Morley and measurements of electromagnetic constants reinforce that c is invariant, a cornerstone of physics and a link among electromagnetism, gravity, and spacetime.</p>",
    "sources": [
      {
        "title": "DESY – Is c constant?",
        "url": "https://www.desy.de/user/projects/Physics/Relativity/SpeedOfLight/speed_of_light.html"
      },
      {
        "title": "NASA Science – Basics of Spaceflight: Units of Measure",
        "url": "https://science.nasa.gov/learn/basics-of-space-flight/units/"
      },
      {
        "title": "NASA – Three Ways to Travel at (Nearly) the Speed of Light",
        "url": "https://www.nasa.gov/solar-system/three-ways-to-travel-at-nearly-the-speed-of-light/"
      },
      {
        "title": "NASA AMLNH – The Speed of Light Is Constant",
        "url": "https://www.amnh.org/exhibitions/einstein/light/constant-speed"
      },
      {
        "title": "NASA – Anatomy of an Electromagnetic Wave",
        "url": "https://science.nasa.gov/ems/02_anatomy/"
      }
    ]
  },
    {
    "title": "Observable Universe",
    "content": "<p>The observable universe is the region of space from which light or other signals have reached us since the Big Bang, approximately 13.8 billion years ago. However, because the cosmos has been expanding, these objects are now much farther away.</p><p>Today, the radius of the observable universe is approximately <strong>46 billion light‑years</strong>, making the diameter about 92 billion light‑years. This value is based on comoving distance measurements, which account for the universe’s expansion.</p><p>The observable universe is centered on each observer—every point in space has its own spherical observable universe of the same size. It is bounded not by technology, but by the finite speed of light and the age of the universe.</p><p>This region is home to at least two trillion galaxies, according to recent surveys—far more than earlier estimates of ~100 billion. That means the observable universe contains roughly 10²⁴ stars.</p><p>As the universe continues to expand, some objects now at the observable limit will eventually drift beyond our view, falling outside the cosmic horizon. But for now, we can observe a spherical volume about 92 billion light‑years across.</p>",
    "sources": [
      {
        "title": "ESA – Observable Universe contains ten times more galaxies than thought",
        "url": "https://sci.esa.int/web/hubble/-/58444-observable-universe-contains-ten-times-more-galaxies-than-previously-thought-heic1620"
      },
      {
        "title": "NASA – Age & Size of the Universe Through the Years",
        "url": "https://imagine.gsfc.nasa.gov/educators/programs/cosmictimes/educators/guide/age_size.html"
      },
      {
        "title": "NASA Science – Welcome to the Universe",
        "url": "https://science.nasa.gov/universe/"
      }
    ]
  },
    {
    "title": "Galaxy",
    "content": "<p>A galaxy is a vast, gravitationally bound system of stars, stellar remnants, gas, dust, and dark matter. They range in size from dwarf galaxies with a few thousand stars to giants containing over a trillion stars and spanning more than a million light‑years in diameter.</p><p>There are thought to be over 100 billion galaxies in the universe, but recent studies—including data from NASA and ESA—suggest this number may exceed two trillion.</p><p>Galaxies are classified by shape into three main types: spiral (like the Milky Way), elliptical, and irregular. Active galaxies—those emitting exceptionally bright radiation from their cores—make up around 10 % of observed galaxies.</p><p>The Milky Way is a barred spiral galaxy, part of the Local Group of over 20 galaxies. It contains over 100 billion stars, a stellar disk ~100,000 light‑years across, and a central supermassive black hole.</p><p>Galaxies often cluster together in groups and clusters, which themselves are components of larger structures like superclusters and filaments. These structures form the cosmic web that defines the large‑scale structure of the universe.</p><p>Galaxies evolve through processes like mergers—where two galaxies interact and combine—and internal star formation driven by gas dynamics. Interactions can trigger starbursts, dramatically increasing a galaxy’s stellar birth rate.</p><p>Supermassive black holes, found at the centers of most large galaxies, power active galactic nuclei (AGN), emitting extreme energies and sometimes launching relativistic jets. These AGN influence both galactic and intergalactic environments.</p><p>Dark matter makes up most of a galaxy’s mass. Its presence is inferred from phenomena like flat rotation curves and gravitational lensing—despite being invisible, it profoundly shapes galaxy formation and dynamics.</p><p>Our understanding continues to expand thanks to advanced observations from missions like ESA’s Herschel, Gaia, and NASA/ESA’s Hubble and James Webb Space Telescopes, along with theoretical frameworks and cosmological simulations.</p>",
    "sources": [
      {
        "title": "ESA – Galaxies (CESAR booklet)",
        "url": "https://cesar.esa.int/upload/201801/galaxies_booklet.pdf"
      },
      {
        "title": "NASA Science – Galaxy Basics",
        "url": "https://science.nasa.gov/universe/galaxies/"
      },
      {
        "title": "ESA – Every point is a galaxy (Herschel)",
        "url": "https://sci.esa.int/web/herschel/-/60537-every-point-is-a-galaxy"
      },
      {
        "title": "NASA Science – Galaxy Evolution & Mergers",
        "url": "https://science.nasa.gov/universe/galaxies/evolution/"
      },
      {
        "title": "NASA Science – Galaxy Types",
        "url": "https://science.nasa.gov/universe/galaxies/types/"
      },
      {
        "title": "ESA – Galaxy groups and clusters (The scale of the Universe)",
        "url": "https://www.esa.int/ESA_Multimedia/Images/2014/05/The_scale_of_the_Universe"
      },
      {
        "title": "NASA Science – Large Scale Structures",
        "url": "https://science.nasa.gov/universe/galaxies/large-scale-structures/"
      },
      {
        "title": "NASA – Hubble’s Galaxies",
        "url": "https://science.nasa.gov/mission/hubble/science/universe-uncovered/hubble-galaxies/"
      },
      {
        "title": "ESA – The Galaxy in Context (arXiv)",
        "url": "https://arxiv.org/abs/1602.07702"
      },
      {
        "title": "ESA – The Fundamental Properties of Galaxies (arXiv)",
        "url": "https://arxiv.org/abs/astro-ph/0610016"
      }
    ]
  },
    {
    "title": "Galaxy Cluster",
    "content": "<p>Galaxy clusters are the most massive gravitationally bound structures in the Universe, containing hundreds to thousands of galaxies, vast amounts of hot gas, and a dominant component of dark matter. Typical masses range from 10¹⁴ to 10¹⁵ M☉ (solar masses), and sizes span several million light‑years.</p><p>These clusters form through hierarchical growth: smaller galaxy groups merge over time to create larger clusters. They are the primary building blocks of the cosmic web and serve as anchors for superclusters.</p><p>Most of a cluster’s mass resides in dark matter, inferred from galaxy motions and gravitational lensing. The intracluster medium (ICM) is made of hot plasma at tens of millions of Kelvin, emitting X‑rays observable by telescopes like Chandra and XMM‑Newton.</p><p>Galaxy clusters reveal fundamental physics. Fritz Zwicky first inferred dark matter in the 1930s by noting galaxies moved too quickly to be held by visible mass. Detailed X‑ray and lensing studies confirm that visible galaxies make up only ~1%, while ICM is ~9% and dark matter comprises ~90% of cluster mass.</p><p>Clusters are cosmological tools. Measurements of their number, mass distribution, and growth trace the nature of dark energy and the evolution of large-scale structure.</p><p>They also act as gravitational lenses: their mass bends light from distant galaxies, magnifying and distorting background sources—used to study high-redshift galaxies and map mass distribution.</p><p>Galaxy clusters include familiar nearby examples like the Virgo Cluster, Coma Cluster, and the Perseus Cluster. They also host extreme systems such as the Bullet Cluster—where colliding subclusters provide compelling evidence for dark matter—and distant massive clusters located over 10 billion light‑years away.</p><p>Modern observatories like Hubble, Chandra, and JWST continue to probe cluster dynamics, star formation, black hole growth, and dark matter profiles within these colossal systems.</p>",
    "sources": [
      {
        "title": "NASA Science – Large Scale Structures",
        "url": "https://science.nasa.gov/universe/galaxies/large-scale-structures/"
      },
      {
        "title": "NASA GSFC – Galaxy clusters",
        "url": "https://science.gsfc.nasa.gov/662/research/clusters.html"
      },
      {
        "title": "Center for Astrophysics | Harvard & Smithsonian – Galaxy Clusters",
        "url": "https://www.cfa.harvard.edu/research/topic/galaxy-clusters"
      },
      {
        "title": "NASA – Untangling a Knot of Galaxy Clusters",
        "url": "https://www.nasa.gov/universe/untangling-a-knot-of-galaxy-clusters/"
      }
    ]
  },
    {
    "title": "Star",
    "content": "<p>A star is a massive, self-luminous sphere of plasma held together by its own gravity. It shines by converting hydrogen into helium through nuclear fusion in its core, releasing energy across the electromagnetic spectrum.</p><p>Stars form in large clouds of gas and dust—called nebulae—where regions collapse under gravity, creating protostars. When core temperatures reach millions of degrees, fusion ignites, marking the birth of a star. Observatories like Hubble and missions such as NASA’s Infrared telescopes have imaged this process in action.</p><p>The majority (~90%) of stars are main-sequence stars, fusing hydrogen into helium. These include a broad range of masses—from red dwarfs (small, long-lived, faint) to blue giants and supergiants (massive, hot, and short-lived). Our Sun is a middle-aged G-type main sequence star.</p><p>As stars exhaust their hydrogen fuel, their evolution depends on mass. Lower-mass stars become red giants then white dwarfs. More massive stars undergo successive fusion stages, end in supernova explosions, and leave behind neutron stars or black holes.</p><p>Stars vary in brightness, size, and color. They are classified using spectral types (O, B, A, F, G, K, M) based on surface temperature and absorption lines. For example, O- and B-type stars are hot and blue; M-type are cool and red.</p><p>Stellar remnants include white dwarfs (Earth-sized cores of former stars), neutron stars (city-sized remnants of supernovae), and black holes (extreme-density objects from the most massive stars).</p><p>Stars are not static—many rotate, exhibit magnetic activity (like sunspots and flares), and broadcast stellar winds. Their lifecycle enriches the interstellar medium with heavier elements, seeding future generations of stars and planets.</p><p>Stars often exist in groups—binary or systems within star clusters and galaxies. Their properties are studied via brightness, spectra, parallax, variability, and statistical surveys by missions like Gaia and Kepler.</p>",
    "sources": [
      {
        "title": "NASA Science – Star Types",
        "url": "https://science.nasa.gov/universe/stars/types/"
      },
      {
        "title": "NASA Imagine – Stars: Fundamentals",
        "url": "https://imagine.gsfc.nasa.gov/science/objects/stars1.html"
      },
      {
        "title": "NASA Hubble – Exploring the Birth of Stars",
        "url": "https://science.nasa.gov/mission/hubble/science/science-highlights/exploring-the-birth-of-stars/"
      }
    ]
  },
    {
    "title": "Protostar",
    "content": "<p>A protostar is an early stage in star formation, occurring when a dense region of a molecular cloud collapses under gravity, forming a hot, rotating object still gathering mass from its surroundings.</p><p>As the collapsing gas heats up due to friction and increasing central pressure, the core becomes opaque and radiates primarily in the infrared. It is not yet hot enough for sustained nuclear fusion in its core.</p><p>Protostars are often embedded in dusty envelopes and accretion disks. Some launch powerful bipolar jets and stellar outflows, which collide with surrounding gas to produce Herbig–Haro objects—visible in infrared imagery captured by telescopes like Hubble and JWST.</p><p>They evolve through observational categories: Class 0 (deeply embedded), Class I (envelope partially cleared), and later stages before entering the main sequence. This phase lasts roughly 100,000 to 500,000 years for low-mass protostars.</p><p>Some protostars show dramatic variability. For example, HOPS 383, a Class 0 protostar in Orion, exhibited a sudden infrared-bright “growth spurt” — highlighting episodic accretion events.</p><p>JWST has imaged protostars like L1527 in Taurus, revealing “hourglass” structures and shocked molecular gas in their outflows. These observations deepen our understanding of disk formation, jet dynamics, and early stellar evolution.</p><p>Ultimately, a protostar becomes a pre-main-sequence star when its core reaches the critical temperature (~10 million K) to initiate hydrogen fusion. Leftover disk material may then form planets, asteroids, and comets.</p>",
    "sources": [
      {
        "title": "NASA – Protostars",
        "url": "https://www.nasa.gov/universe/stars/protostars/"
      },
      {
        "title": "NASA – Hubble Spies Newly Forming Star",
        "url": "https://science.nasa.gov/missions/hubble/hubble-spies-newly-forming-star-incubating-in-ic-2631/"
      },
      {
        "title": "NASA – Webb Catches Fiery Hourglass New Star",
        "url": "https://www.nasa.gov/universe/nasas-webb-catches-fiery-hourglass-as-new-star-forms/"
      },
      {
        "title": "ESA – Protostar L1527 Image",
        "url": "https://www.esa.int/ESA_Multimedia/Images/2022/11/Protostar_L1527"
      },
      {
        "title": "NASA – Protostars Archives",
        "url": "https://science.nasa.gov/category/universe/stars/protostars/"
      },
      {
        "title": "NASA GSFC – Star Basics",
        "url": "https://science.nasa.gov/universe/stars/"
      },
      {
        "title": "NASA – Protostar Outburst HOPS 383",
        "url": "https://www.nasa.gov/universe/nasa-satellites-catch-growth-spurt-from-newborn-protostar/"
      }
    ]
  }
]
